In [10]:
import pandas as pd

# Create DataFrames
students = pd.DataFrame({
    'student_id': [1, 2, 3, 4, 5],
    'name': ['Ali', 'Sara', 'Bilal', 'Ayesha', 'Ahmed'],
    'age': [20, 21, 22, 23, 24],
    'dept_id': [101, 102, 103, 101, 104]
})

In [11]:
departments = pd.DataFrame({
    'dept_id': [101, 102, 103, 104],
    'department_name': ['Computer Science', 'Mathematics', 'Physics', 'Data Science'],
    'location': ['Lahore', 'Karachi', 'Islamabad', 'Peshawar']
})

In [12]:
# Merge the DataFrames
marge_df = pd.merge(students,departments, on='dept_id', how='inner')

In [13]:
marge_df

   student_id    name  age  dept_id   department_name   location
0           1     Ali   20      101  Computer Science     Lahore
1           2    Sara   21      102       Mathematics    Karachi
2           3   Bilal   22      103           Physics  Islamabad
3           4  Ayesha   23      101  Computer Science     Lahore
4           5   Ahmed   24      104      Data Science   Peshawar